src/test/resources/requests/get_records_5_soap.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<GetRecords maxRecords="10" outputFormat="text/xml" outputSchema="csw:profile"
			requestId="csw:1" resultType="results" startPosition="1"
			xmlns="http://www.opengis.net/cat/csw/2.0.2" xmlns:ogc="http://www.opengis.net/ogc" service="CSW" version="2.0.2">
			<Query typeNames="csw:dataset">
				<ElementSetName typeNames="">brief</ElementSetName>
				<!-- (denominator > 50 AND denominator < 100) OR (denominator >= 10 AND denominator <= 15) -->
				<Constraint version="1.1.0">
					<ogc:Filter>
						<ogc:Or>
							<ogc:And>
								<ogc:PropertyIsGreaterThan>
									<ogc:PropertyName>Denominator</ogc:PropertyName>
									<ogc:Literal>50</ogc:Literal>
								</ogc:PropertyIsGreaterThan>
								<ogc:PropertyIsLessThan>
									<ogc:PropertyName>Denominator</ogc:PropertyName>
									<ogc:Literal>100</ogc:Literal>
								</ogc:PropertyIsLessThan>
							</ogc:And>
							<ogc:And>
								<ogc:PropertyIsGreaterThanOrEqualTo>
									<ogc:PropertyName>Denominator</ogc:PropertyName>
									<ogc:Literal>10</ogc:Literal>
								</ogc:PropertyIsGreaterThanOrEqualTo>
								<ogc:PropertyIsLessThanOrEqualTo>
									<ogc:PropertyName>Denominator</ogc:PropertyName>
									<ogc:Literal>15</ogc:Literal>
								</ogc:PropertyIsLessThanOrEqualTo>
							</ogc:And>
						</ogc:Or>
					</ogc:Filter>
				</Constraint>
			</Query>
		</GetRecords>
	</soapenv:Body>
</soapenv:Envelope>